{
    "en": {
        "init_reaction": "Reaction: {}",
        "init_modrole": "Mod role: {}",
        "init_admin": "Only via Admins.",
        "creating_init_msg": "Creating new role management init message.",
        "role_user_not_configured": "I don't like you, so I won't let you add or remove roles via command.",
        "role_user_no_modrole": "The role {} has no mod role, so I won't let you do this.",
        "role_user_already": "User {} has role {} already.",
        "role_user_added": "My trainer was too lazy to train me how to validate, but role {} should be added to {}.",
        "role_user_doesnt_have": "User {} doesn't have role {}.",
        "role_user_removed": "My trainer was too lazy to train me how to validate, but role {} should be removed from {}.",
        "role_user_bad_arg": "I don't know that move, I only know add or del for argument action.",
        "role_add_updated": "I was too lazy to create a new role with the name {}, so I updated the existing.",
        "role_add_config": "I was too lazy to create a new role with the name {} on the server, so I just added the existing one to my own role list.",
        "role_add_created": "My trainer was too lazy to train me how to validate, but the role {} with color {} should be created now.",
        "role_del": "My trainer was too lazy to train me how to validate, but the role {} should be deleted now.",
        "role_untrack": "I removed role {} from my role management, so it isn't my problem anymore.",
        "role_request_no_modrole": "Sorry, but I can't find a mod role for {} :frowning:",
        "role_request_ping": "Hey {}, the user {} requests the role {}!",
        "role_update": "I'm a lazy Treecko, but especially for you, I updated my role management.",
        "must_set_channel_id": "For updating role management, the channel for the init message bust be set before via `!role update channel=<channel name>`.",
        "channel_cant_changed": "A init message is already set, so the channel can't changed.",
        "invalid_channel": "The channel must be an existing channel on this server.",
        "channel_updated": "The channel is updated.",
        "not_init_message": "I would love to give you the jump url to the init message, but I can't find any init message.",

        "help_role": "Adds or removes the role to/from users roles",
        "desc_role": "Adds or removes the role to or from users roles. Only usable for users with corresponding mod role.\nAdmins can add or remove all roles including roles which aren't managed.",
        "usage_role": "<user> <add|del> <role>",
        "help_add": "Creates a new role or updates it",
        "desc_add": "Creates a new role on the server with the given management data.\nIf an emoji is given, the role will be self-assignable by the users via reaction in the role init message. If a mod role is given, a user with the mod role can add or remove the role to or from the user using '!role <user> <add|del> <role>'. As color a color name like 'blue' can be given or a hexcode like '#0000ff'.\n\nIf the role already exists, it will be added as managed role using the given data. If the role is already managed, its data will be updated.",
        "usage_add": "<role name> [emoji|mod role] [color]",
        "help_del": "Deletes a role from the server",
        "desc_del": "Deletes the given role from the server. If a role will be deleted on the server, also its managed data will be removed.",
        "usage_del": "<role>",
        "help_untrack": "Removes the managed role data",
        "desc_untrack": "Removes the managed role data, but not the role itself from the server. After that, the role only can be assigned using Discords native role features.",
        "usage_untrack": "<role>",
        "help_request": "Pings the mod role for a role request",
        "desc_request": "Pings the roles corresponding mod role, that the executing user requests the given role.",
        "usage_request": "<role name>",
        "help_update": "Reloads the server role data",
        "desc_update": "Reloads the role data from server and updates all managed roles. This includes removing deleted server roles from being managed.\nIf a message content is given, this message will be used for the role management init message text.\n\nBefore using managed roles, the channel for the init message must be set using '!role update <channel>'.",
        "usage_update": "[channel|message...]",
        "help_msg": "Returns the jumplink to the init message",
        "desc_msg": "Returns the jumplink to the role management init message"
    },
    "de": {
        "init_reaction": "{}",
        "init_modrole": "Modrolle: {}",
        "init_admin": "Nur via Admins.",
        "creating_init_msg": "Erstelle neue Rollenmanagement-Init-Nachricht.",
        "role_user_not_configured": "Ich mag dich nicht, deswegen lass ich dich keine neuen Rollen hinzufügen oder löschen.",
        "role_user_no_modrole": "Die Rolle {} hat keine Modrolle, daher lass ich dich das nicht machen.",
        "role_user_already": "User {} hat die Rolle {} bereits.",
        "role_user_added": "Mein Trainer war zu faul mir beizubringen wie ich das validieren kann, aber {1} sollte nun die Rolle {0} haben.",
        "role_user_doesnt_have": "User {} hat die Rolle {} nicht.",
        "role_user_removed": "Mein Trainer war zu faul mir beizubringen wie ich das validieren kann, aber {1} sollte nun nicht mehr die Rolle {0} haben.",
        "role_user_bad_arg": "Ich weiß nicht was du meinst, ich kenn nur add und del für das action-Argument.",
        "role_add_updated": "Ich war zu faul eine neue Rolle {} zu erstellen, also hab ich die bereits existierende aktualisiert.",
        "role_add_config": "Ich war zu faul auf dem Server eine neue Rolle {} zu erstellen, also hab ich die bestehende einfach zu meiner eigenen Rollenliste hinzugefügt",
        "role_add_created": "Mein Trainer war zu faul mir beizubringen wie ich das validieren kann, aber die Rolle {} sollte nun mit der Farbe {} erstellt worden sein.",
        "role_del": "Mein Trainer war zu faul mir beizubringen wie ich das validieren kann, aber die Rolle {} sollte nun gelöscht sein.",
        "role_untrack": "Ich habe die Rolle {} von meinem Rollenmanagement gelöscht, sie ist also nun nicht mehr mein Problem.",
        "role_request_no_modrole": "Sorry, aber ich kann keine Modrolle für {} finden :frowning:",
        "role_request_ping": "Hey {}, da fragt {} ob man ihm/ihr/whatever die Rolle {} geben kann!",
        "role_update": "Ich bin ein faules Geckarbor, aber extra für dich hab ich mein Rollenmanagement ausnahmsweise doch aktualisiert.",
        "must_set_channel_id": "Bevor das Rollenmanagement aktualisiert werden kann, muss zuvor ein Channel mithilfe von `!role update channel=<channel name>` festgelegt werden.",
        "channel_cant_changed": "Eine Init-Nachricht ist bereits gesetzt, der Channel kann daher nicht mehr geändert werden.",
        "invalid_channel": "Der Channel muss ein existierender Channel auf diesem Server sein.",
        "channel_updated": "Channel aktualisiert.",
        "not_init_message": "Ich würde dir gerne den Sprunglink zur Init-Nachricht geben, allerdings kann ich keine Init-Nachricht finden.",

        "help_role": "Fügt eine Rolle einem User hinzu oder entfernt sie",
        "desc_role": "Fügt eine Rolle einem User hinzu oder entfert eine Rolle von einem User. Nur nutzbar, wenn der ausführende User die dazugehörige Modrolle hat.\nAdmins können alle Rollen hinzufügen oder entfernen, inklusive nicht verwalteten Rollen.",
        "usage_role": "<User> <add|del> <Rolle>",
        "help_add": "Erstellt eine neue Rolle oder aktualisiert sie",
        "desc_add": "Erstellt eine neue Rolle mit den angegebenen Daten.\nWenn ein Emoji angegeben ist, kann sich jeder User die Rolle mithilfe von Reactions in der Init-Nachricht selbst geben und nehmen. Wenn eine Modrolle angegeben ist, können nur User mit der Modrolle die Rolle mithilfe von '!role <User> <add|del> <Rolle>' hinzufügen oder entfernen. Als Farbe kann entweder der englische Farbname wie 'blue' oder der Hexcode (#0000ff) angegeben werden.\n\nWenn die Rolle bereits auf dem Server existiert wird sie als verwaltete Rolle aufgenommen. Ist die Rolle bereits verwaltet, werden die Daten entsprechend aktualisiert.",
        "usage_add": "<Rollenname> [Emoji|Modrolle] [Farbe]",
        "help_del": "Löscht eine Rolle vom Server",
        "desc_del": "Löscht die angegebene Rolle vom Server. Von gelöschten Rollen werden auch automatisch alle Verwaltungsdaten gelöscht.",
        "usage_del": "<Rolle>",
        "help_untrack": "Entfernt die Verwaltungsdaten der Rolle",
        "desc_untrack": "Entfernt die Verwaltungsdaten der Rolle, aber nicht die Rolle selbst. Die Rolle kann anschließend nur noch mithilfe der nativen Discord-Features hinzugefügt oder entfernt werden.",
        "usage_untrack": "<Rolle>",
        "help_request": "Pingt die Modrolle für eine Rollenanfrage",
        "desc_request": "Pingt die zugehörige Modrolle, damit jemand dem anzufragenden User die gewünschte Rolle geben kann.",
        "usage_request": "<Rollenname>",
        "help_update": "Aktualisiert die Rollendaten vom Server",
        "desc_update": "Lädt die Rollendaten neu vom Server ein und aktualisiert deren Verwaltungsdaten. Das schließt auch das entfernen von bereits gelöschten Rollen ein.\nWenn eine Nachricht angegeben ist, wird diese als Nachrichtentext für die Init-Nachricht genutzt.\n\nBevor verwaltete Rollen genutzt werden können, muss mithilfe von '!role update <Channel>' der Channel für die Init-Nachricht festgelegt werden.",
        "usage_update": "[Channel|Nachricht...]",
        "help_msg": "Gibt den Link zur Init-Nachricht aus",
        "desc_msg": "Gibt den Sprunglink zur Init-Nachricht des Rollenmanagements zurück."
    }
}